---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DWFMarkup
source: html/23505d2c-452b-63c2-6952-922842c0bf68.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.DWFMarkup Property

An external resource type representing DWF markups data.
 This type is reserved for future expansion but not yet implemented.

## Syntax (C#)
```csharp
public static ExternalResourceType DWFMarkup { get; }
```